# Напишите функцию которая принимает 2 аргумента.
# Эти аргументы могут быть любого типа данных
# но функция должна Вам вернуть эти аргументы как тип данных List.

def return_list(a, b):
    return list(str(a)), list(str(b))

print(return_list(963, 76))

